<?php
$fee_year = [];
for($i = (int)date('Y'); $i >= 2015; $i--) {
    array_push($fee_year, $i);
}

return [
    //지역
    'region' => [
        '1' => '서울|서울특별시',
        '2' => '인천|인천광역시',
        '3' => '경기|경기도',
        '4' => '대전',
        '5' => '충북|충청북도',
        '6' => '충남|충청남도',
        '7' => '전북|전라북도',
        '8' => '광주|광주광역시',
        '9' => '전남|전라남도',
        '10' => '대구',
        '11' => '경북|경상북도',
        '12' => '부산',
        '13' => '경남|경상남도',
        '14' => '강원',
        '15' => '울산',
        '16' => '제주',
        '17' => '세종',
    ],

    //분류
    'category' => [
        'A' => '전문회원',
        'B' => '부정맥 중재시술인증의',
    ],

    'search' => [
        'name_kr' => '이름',
        'uid' => '아이디',
        'email' => '이메일',
        'license_number' => '면허번호',
    ]
];
