<?php

return [
    // ================== ip check ==================
    'ipCheck' => [
        '218.235.94.217',
//        '218.235.94.247',
        '218.235.94.223',
    ],

    // ================== asset version ==================
    'asset_version' => '20230605',

    // ================= api =================
    'api' => [
        'url' => env('APP_URL') . '/api',
    ],

    // ================= web(국문) =================
    'web' => [
        'app_name' => '대한부정맥',
        'url' => env('APP_URL'),
    ],

    // ================= web_en(영문) =================
    'web_en' => [
        'app_name' => 'The Korean 대한부정맥',
        'url' => env('APP_URL') . '/en',
    ],

    // ================= admin =================
    'admin' => [
        'app_name' => '관리자 | 대한부정맥',
        'url' => env('APP_URL') . '/admin',
    ],

    // ================= general =================
    'general' => [
        'app_name' => '일반인 | 대한부정맥',
        'url' => env('APP_URL') . '/general',
    ],


    // ================= 학회 정보 =================
    'info' => [
        'tel' => '02-318-5416',
        'multi_tel' => '',
        'fax' => '02-318-5417',
        'email' => 'khrs@k-hrs.org',
        'zipcode' => '04323',
        'addr' => '서울시 용산구 한강대로 372 센트레빌아스테리움 서울 A동 1604호',
        'bank' => '우리은행',
        'account' => '123457674757',
    ]
];
