<?php

$fee_year = [];

for($i = (int)date('Y'); $i >= 2015; $i--) {
    array_push($fee_year, $i);
}

// 회비 컨피그
return [

    //카테고리
    'category' => [
        'A' => '회원',
        'S' => '전문회원',
    ],

    // 내역
    'detail' => [
        'A' => '연회비',
        'B' => '입회비',
//        'Z' => '기타',
    ],

    // 금액
    'price' => [
        'A' => 10000, // 회원 연회비
        'S' => 100000, // 전문회원 연회비
//        'Z' => '', // 기타는 가격 설정 안함 직접입력
    ],

    // 결제방법
    'method' => [
//        'C' => '카드결제',
        'B' => '무통장입금',
    ],

    // 년도
    'year' => $fee_year,

    // 입금상태
    'pay_status' => [
        'A' => '미납',
//        'B' => '입금 확인중',
        'C' => '완납',
//        'D' => '면제',
    ],

    'search' => [
        'name_kr' => '이름',
        'uid' => '아이디',
        'email' => '이메일',
        'license_number' => '면허번호',
    ]
];
